fio.out
Seq-Read: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
Seq-Write: (g=1): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
Rand-Read-512K: (g=2): rw=randread, bs=(R) 512KiB-512KiB, (W) 512KiB-512KiB, (T) 512KiB-512KiB, ioengine=libaio, iodepth=1
Rand-Write-512K: (g=3): rw=randwrite, bs=(R) 512KiB-512KiB, (W) 512KiB-512KiB, (T) 512KiB-512KiB, ioengine=libaio, iodepth=1
Rand-Read-4K: (g=4): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
Rand-Write-4K: (g=5): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
Rand-Read-4K-QD32: (g=6): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
Rand-Write-4K-QD32: (g=7): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.25
Starting 8 processes

Seq-Read: (groupid=0, jobs=1): err= 0: pid=613866: Wed Dec 14 20:08:47 2022
  read: IOPS=2043, BW=2043MiB/s (2143MB/s)(19.0GiB/10001msec)
    slat (usec): min=21, max=175, avg=25.67, stdev= 1.35
    clat (usec): min=326, max=1621, avg=463.33, stdev=60.50
     lat (usec): min=351, max=1797, avg=489.05, stdev=60.72
    clat percentiles (usec):
     |  1.00th=[  363],  5.00th=[  383], 10.00th=[  400], 20.00th=[  416],
     | 30.00th=[  433], 40.00th=[  445], 50.00th=[  457], 60.00th=[  469],
     | 70.00th=[  486], 80.00th=[  502], 90.00th=[  537], 95.00th=[  562],
     | 99.00th=[  652], 99.50th=[  709], 99.90th=[  906], 99.95th=[  971],
     | 99.99th=[ 1074]
   bw (  MiB/s): min= 1817, max= 2070, per=100.00%, avg=2046.93, stdev=61.07, samples=19
   iops        : min= 1817, max= 2070, avg=2046.89, stdev=61.20, samples=19
  lat (usec)   : 500=78.82%, 750=20.86%, 1000=0.28%
  lat (msec)   : 2=0.04%
  cpu          : usr=0.22%, sys=5.75%, ctx=20438, majf=0, minf=266
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=20435,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
Seq-Write: (groupid=1, jobs=1): err= 0: pid=614056: Wed Dec 14 20:08:47 2022
  write: IOPS=1743, BW=1743MiB/s (1828MB/s)(17.0GiB/10001msec); 0 zone resets
    slat (nsec): min=20370, max=48641, avg=27852.45, stdev=1140.66
    clat (usec): min=326, max=18949, avg=545.41, stdev=491.59
     lat (usec): min=348, max=18976, avg=573.32, stdev=491.62
    clat percentiles (usec):
     |  1.00th=[  400],  5.00th=[  433], 10.00th=[  449], 20.00th=[  474],
     | 30.00th=[  486], 40.00th=[  502], 50.00th=[  515], 60.00th=[  529],
     | 70.00th=[  545], 80.00th=[  562], 90.00th=[  594], 95.00th=[  660],
     | 99.00th=[  906], 99.50th=[ 1237], 99.90th=[ 8094], 99.95th=[15533],
     | 99.99th=[17171]
   bw (  MiB/s): min= 1514, max= 1856, per=99.78%, avg=1739.23, stdev=108.87, samples=19
   iops        : min= 1514, max= 1856, avg=1739.21, stdev=108.88, samples=19
  lat (usec)   : 500=39.92%, 750=57.51%, 1000=1.85%
  lat (msec)   : 2=0.48%, 4=0.07%, 10=0.09%, 20=0.08%
  cpu          : usr=0.89%, sys=4.62%, ctx=17434, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,17432,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
Rand-Read-512K: (groupid=2, jobs=1): err= 0: pid=614271: Wed Dec 14 20:08:47 2022
  read: IOPS=2817, BW=1409MiB/s (1477MB/s)(13.8GiB/10001msec)
    slat (nsec): min=9880, max=87811, avg=13425.41, stdev=737.77
    clat (usec): min=234, max=762, avg=341.06, stdev=59.77
     lat (usec): min=248, max=785, avg=354.55, stdev=59.78
    clat percentiles (usec):
     |  1.00th=[  253],  5.00th=[  258], 10.00th=[  260], 20.00th=[  265],
     | 30.00th=[  281], 40.00th=[  343], 50.00th=[  355], 60.00th=[  367],
     | 70.00th=[  379], 80.00th=[  392], 90.00th=[  412], 95.00th=[  429],
     | 99.00th=[  465], 99.50th=[  482], 99.90th=[  519], 99.95th=[  545],
     | 99.99th=[  742]
   bw (  MiB/s): min= 1401, max= 1422, per=100.00%, avg=1409.40, stdev= 6.01, samples=19
   iops        : min= 2802, max= 2844, avg=2818.74, stdev=12.04, samples=19
  lat (usec)   : 250=0.45%, 500=99.34%, 750=0.21%, 1000=0.01%
  cpu          : usr=0.12%, sys=4.47%, ctx=28179, majf=0, minf=138
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=28179,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
Rand-Write-512K: (groupid=3, jobs=1): err= 0: pid=614443: Wed Dec 14 20:08:47 2022
  write: IOPS=3423, BW=1712MiB/s (1795MB/s)(16.7GiB/10001msec); 0 zone resets
    slat (nsec): min=9720, max=37051, avg=14039.69, stdev=1140.65
    clat (usec): min=170, max=19108, avg=277.62, stdev=188.50
     lat (usec): min=184, max=19122, avg=291.70, stdev=188.49
    clat percentiles (usec):
     |  1.00th=[  206],  5.00th=[  223], 10.00th=[  231], 20.00th=[  241],
     | 30.00th=[  249], 40.00th=[  258], 50.00th=[  265], 60.00th=[  273],
     | 70.00th=[  285], 80.00th=[  302], 90.00th=[  326], 95.00th=[  355],
     | 99.00th=[  490], 99.50th=[  578], 99.90th=[  857], 99.95th=[  947],
     | 99.99th=[10683]
   bw (  MiB/s): min= 1488, max= 1787, per=99.96%, avg=1711.03, stdev=66.90, samples=19
   iops        : min= 2976, max= 3574, avg=3421.95, stdev=133.79, samples=19
  lat (usec)   : 250=31.17%, 500=67.91%, 750=0.73%, 1000=0.16%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%
  cpu          : usr=1.29%, sys=4.49%, ctx=34240, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,34239,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
Rand-Read-4K: (groupid=4, jobs=1): err= 0: pid=615452: Wed Dec 14 20:08:47 2022
  read: IOPS=11.9k, BW=46.3MiB/s (48.6MB/s)(463MiB/10001msec)
    slat (nsec): min=1100, max=42870, avg=1587.29, stdev=389.26
    clat (usec): min=51, max=3525, avg=82.29, stdev=34.46
     lat (usec): min=54, max=3526, avg=83.91, stdev=34.51
    clat percentiles (usec):
     |  1.00th=[   62],  5.00th=[   73], 10.00th=[   74], 20.00th=[   75],
     | 30.00th=[   76], 40.00th=[   76], 50.00th=[   77], 60.00th=[   79],
     | 70.00th=[   89], 80.00th=[   91], 90.00th=[   92], 95.00th=[   94],
     | 99.00th=[  104], 99.50th=[  192], 99.90th=[  586], 99.95th=[  742],
     | 99.99th=[ 1205]
   bw (  KiB/s): min=40487, max=48744, per=100.00%, avg=47543.63, stdev=2192.20, samples=19
   iops        : min=10121, max=12186, avg=11885.84, stdev=548.17, samples=19
  lat (usec)   : 100=98.93%, 250=0.71%, 500=0.21%, 750=0.09%, 1000=0.03%
  lat (msec)   : 2=0.02%, 4=0.01%
  cpu          : usr=2.69%, sys=2.03%, ctx=118628, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=118628,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
Rand-Write-4K: (groupid=5, jobs=1): err= 0: pid=620042: Wed Dec 14 20:08:47 2022
  write: IOPS=69.8k, BW=273MiB/s (286MB/s)(2727MiB/10001msec); 0 zone resets
    slat (nsec): min=1050, max=161461, avg=1213.46, stdev=223.61
    clat (nsec): min=250, max=468803, avg=12835.37, stdev=2154.76
     lat (usec): min=10, max=470, avg=14.07, stdev= 2.17
    clat percentiles (nsec):
     |  1.00th=[11328],  5.00th=[11456], 10.00th=[11712], 20.00th=[11712],
     | 30.00th=[11840], 40.00th=[11968], 50.00th=[12096], 60.00th=[12224],
     | 70.00th=[12352], 80.00th=[12608], 90.00th=[17024], 95.00th=[17792],
     | 99.00th=[18816], 99.50th=[19584], 99.90th=[21888], 99.95th=[25984],
     | 99.99th=[27520]
   bw (  KiB/s): min=276896, max=281768, per=100.00%, avg=279362.32, stdev=1040.22, samples=19
   iops        : min=69224, max=70442, avg=69840.53, stdev=260.04, samples=19
  lat (nsec)   : 500=0.01%
  lat (usec)   : 4=0.01%, 10=0.03%, 20=99.52%, 50=0.44%, 100=0.01%
  lat (usec)   : 250=0.01%, 500=0.01%
  cpu          : usr=8.19%, sys=12.56%, ctx=698239, majf=0, minf=14
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,698239,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
Rand-Read-4K-QD32: (groupid=6, jobs=1): err= 0: pid=620232: Wed Dec 14 20:08:47 2022
  read: IOPS=310k, BW=1212MiB/s (1271MB/s)(11.8GiB/10001msec)
    slat (nsec): min=940, max=33250, avg=1471.44, stdev=794.12
    clat (usec): min=21, max=659, avg=101.35, stdev=28.28
     lat (usec): min=22, max=660, avg=102.86, stdev=28.27
    clat percentiles (usec):
     |  1.00th=[   71],  5.00th=[   76], 10.00th=[   78], 20.00th=[   82],
     | 30.00th=[   85], 40.00th=[   90], 50.00th=[   94], 60.00th=[   98],
     | 70.00th=[  104], 80.00th=[  117], 90.00th=[  139], 95.00th=[  159],
     | 99.00th=[  206], 99.50th=[  227], 99.90th=[  277], 99.95th=[  297],
     | 99.99th=[  347]
   bw (  MiB/s): min= 1159, max= 1217, per=100.00%, avg=1212.38, stdev=12.82, samples=19
   iops        : min=296914, max=311573, avg=310368.53, stdev=3282.24, samples=19
  lat (usec)   : 50=0.01%, 100=64.34%, 250=35.44%, 500=0.22%, 750=0.01%
  cpu          : usr=26.29%, sys=49.35%, ctx=692474, majf=0, minf=44
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=3103120,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
Rand-Write-4K-QD32: (groupid=7, jobs=1): err= 0: pid=620442: Wed Dec 14 20:08:47 2022
  write: IOPS=366k, BW=1431MiB/s (1501MB/s)(13.0GiB/10001msec); 0 zone resets
    slat (nsec): min=950, max=24280, avg=1721.38, stdev=798.45
    clat (usec): min=44, max=9806, avg=85.24, stdev=71.05
     lat (usec): min=47, max=9807, avg=87.02, stdev=71.03
    clat percentiles (usec):
     |  1.00th=[   65],  5.00th=[   68], 10.00th=[   70], 20.00th=[   74],
     | 30.00th=[   76], 40.00th=[   79], 50.00th=[   82], 60.00th=[   85],
     | 70.00th=[   88], 80.00th=[   93], 90.00th=[   99], 95.00th=[  108],
     | 99.00th=[  161], 99.50th=[  196], 99.90th=[  265], 99.95th=[  285],
     | 99.99th=[  375]
   bw (  MiB/s): min= 1113, max= 1541, per=99.90%, avg=1429.88, stdev=92.99, samples=19
   iops        : min=285008, max=394622, avg=366050.00, stdev=23806.60, samples=19
  lat (usec)   : 50=0.01%, 100=90.73%, 250=9.10%, 500=0.16%, 750=0.01%
  lat (msec)   : 4=0.01%, 10=0.01%
  cpu          : usr=29.72%, sys=59.68%, ctx=169619, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,3664636,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=2043MiB/s (2143MB/s), 2043MiB/s-2043MiB/s (2143MB/s-2143MB/s), io=19.0GiB (21.4GB), run=10001-10001msec

Run status group 1 (all jobs):
  WRITE: bw=1743MiB/s (1828MB/s), 1743MiB/s-1743MiB/s (1828MB/s-1828MB/s), io=17.0GiB (18.3GB), run=10001-10001msec

Run status group 2 (all jobs):
   READ: bw=1409MiB/s (1477MB/s), 1409MiB/s-1409MiB/s (1477MB/s-1477MB/s), io=13.8GiB (14.8GB), run=10001-10001msec

Run status group 3 (all jobs):
  WRITE: bw=1712MiB/s (1795MB/s), 1712MiB/s-1712MiB/s (1795MB/s-1795MB/s), io=16.7GiB (17.0GB), run=10001-10001msec

Run status group 4 (all jobs):
   READ: bw=46.3MiB/s (48.6MB/s), 46.3MiB/s-46.3MiB/s (48.6MB/s-48.6MB/s), io=463MiB (486MB), run=10001-10001msec

Run status group 5 (all jobs):
  WRITE: bw=273MiB/s (286MB/s), 273MiB/s-273MiB/s (286MB/s-286MB/s), io=2727MiB (2860MB), run=10001-10001msec

Run status group 6 (all jobs):
   READ: bw=1212MiB/s (1271MB/s), 1212MiB/s-1212MiB/s (1271MB/s-1271MB/s), io=11.8GiB (12.7GB), run=10001-10001msec

Run status group 7 (all jobs):
  WRITE: bw=1431MiB/s (1501MB/s), 1431MiB/s-1431MiB/s (1501MB/s-1501MB/s), io=13.0GiB (15.0GB), run=10001-10001msec

Disk stats (read/write):
  nvme0n1: ios=3345441/4452943, merge=0/0, ticks=357459/300569, in_queue=660209, util=97.35%